tutorials/viscoelastic/viscoelasticFluidFoam/XPP_SE/system/sampleDictPSD
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


interpolationScheme cellPointFace;

writeFormat     xmgr;

sampleSets
(

    midPoint
    {
        name            PSD_0;
        axis            distance;
        start           (0.076  0.0000001  0.00005);
        end             (0.084  0.0000001  0.00005);
        nPoints         200;
    }

    midPoint
    {
        name            PSD_04;
        axis            distance;
        start           (0.076  0.0004  0.00005);
        end             (0.084  0.0004  0.00005);
        nPoints         200;
    }

    midPoint
    {
        name            PSD_049;
        axis            distance;
        start           (0.076  0.00049  0.00005);
        end             (0.084  0.00049  0.00005);
        nPoints         200;
    }


);

fields
(
    PSD
);


// ************************************************************************* //
